Autodesk.Revit.DB.TagByExample.IsAllowedTag(Autodesk.Revit.DB.IndependentTag)
Determines if the given tag is allowed for Tag By Example.
tag:
Tag to check.
Returns:
True if the tag is allowed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.TagByExample.CreateTagByExample(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.IndependentTag,Autodesk.Revit.DB.LinkElementId,Autodesk.Revit.DB.TagByExampleOptions)
Create a new tag according to an example tag and a target host.
document:
The document which owns the example tag and view.
view:
The view in which the example tag are visible and the new tag will be created.
exampleTag:
The example tag to recreate.
targetHost:
The id of the target host to tag. The host may be in Revit link instance.
options:
The creation options which control the placement of the new tag.
Returns:
The id of the new tag.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The example tag cannot be created on the host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.TagByExample
Supports the Tag By Example feature, which allows users to create tags by selecting an example tag
and target hosts.